<a href="https://colab.research.google.com/github/yagnik99/Covid-19-Tweets-Sentiment-Analysis/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
def factorial(int):
  ''' This method gives factorial of inputed number'''

  if int<0:
    print('invalid no/ no factorial for this number')
  else:
    factorial = 1
    for number in range(1, int+1):
      factorial = factorial * number
    return factorial

In [ ]:
factorial(1)

1

In [ ]:
factorial(0)

1

In [ ]:
factorial(3)

6

In [ ]:
factorial(-1)

invalid no/ no factorial for this number

In [ ]:
def fibonaci(int):
  ''' This method would return nth no of fibonaci series value'''

  list1 = [0,1]
  fibonaci_value = sum(list1)
  print(fibonaci_value)
  i = 0
  while (i != int):
      fibonaci_value = list1[-2] + list1[-1]
      list1.append(fibonaci_value)
      i = i+1
  return list1[int-1]

In [ ]:
fibonaci(6)

1

5

In [ ]:
import pandas as pd

In [ ]:
a = pd.DataFrame({'name': ['abc', 'def'], 'value1': [2,3]})
a

  name  value1
0  abc       2
1  def       3

In [ ]:
b = pd.DataFrame({'name': ['abc', 'def','xyz', 'abc', 'def'], 'value1': [3,4,8,9,10], 'Value2':[1,2,3,4,5]})
b

  name  value1  Value2
0  abc       3       1
1  def       4       2
2  xyz       8       3
3  abc       9       4
4  def      10       5

In [ ]:
pd.merge(b,a, how='left', on = 'name')

  name  value1_x  Value2  value1_y
0  abc         3       1       2.0
1  def         4       2       3.0
2  xyz         8       3       NaN
3  abc         9       4       2.0
4  def        10       5       3.0